In [6]:
# location finder
import pandas as pd
df = pd.DataFrame({"A" : [1,2,3], "B":[4,5,6]})
print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [7]:
import pandas as pd
df = pd.DataFrame({"A" : [1,2,3], "B":[4,5,6]}, index=["row1", "row2", "row3"])
df

      A  B
row1  1  4
row2  2  5
row3  3  6

In [8]:
df.loc["row2","B"]

5

In [10]:
df.iloc[1,1]

5

In [16]:
import pandas as pd
df = pd.DataFrame({'weight' :[45,88,56,15,71], 
                   'height' : ["sam", "andrea", "alex", "robin", "kia"],
                   'age' :[14,25,55,8,21]})
print(df)

   weight  height  age
0      45     sam   14
1      88  andrea   25
2      56    alex   55
3      15   robin    8
4      71     kia   21

In [17]:
# index 2 way to create 
# inside df
# or out df

In [24]:
import pandas as pd
df = pd.DataFrame({'weight' :[45,88,56,15,71], 
                   'height' : ["sam", "andrea", "alex", "robin", "kia"],
                   'age' :[14,25,55,8,21]},index = ["row1", "row2", "row3", "row4", "row5"])
print(df)

      weight  height  age
row1      45     sam   14
row2      88  andrea   25
row3      56    alex   55
row4      15   robin    8
row5      71     kia   21

In [25]:
index = ["row1", "row2", "row3", "row4", "row5"]
df.index = index
df

      weight  height  age
row1      45     sam   14
row2      88  andrea   25
row3      56    alex   55
row4      15   robin    8
row5      71     kia   21

In [109]:
df.loc["row2","weight"]

88

In [110]:
df.iloc[1,1]

'andrea'

In [38]:
# acces entire row or entire colu

df.loc["row2",()]    #  column blank if we want row

weight        88
height    andrea
age           25
Name: row2, dtype: object

In [112]:
df.loc["row2",:]

weight        88
height    andrea
age           25
Name: row2, dtype: object

In [52]:
# similarly for column

df.iloc[:,1]

row1       sam
row2    andrea
row3      alex
row4     robin
row5       kia
Name: height, dtype: object

In [66]:
df1 = pd.DataFrame({"A":[12,45,5,None,1], "B" : [7,5,54,3,"None"], "C" :[20,16,11,3,4], "D" : [14,3,None,2,6]},index = ["row1", "row2", "row3", "row4", "row5"] )
print(df1)

         A     B   C     D
row1  12.0     7  20  14.0
row2  45.0     5  16   3.0
row3   5.0    54  11   NaN
row4   NaN     3   3   2.0
row5   1.0  None   4   6.0

In [54]:
# use df1 access col a and column d

In [67]:
#

df1.loc[(),"A"]

row1    12.0
row2    45.0
row3     5.0
row4     NaN
row5     1.0
Name: A, dtype: float64

In [68]:
df1.loc[(),"D"]

row1    14.0
row2     3.0
row3     NaN
row4     2.0
row5     6.0
Name: D, dtype: float64

In [1]:
df1.loc[(),["A":"D"]]

SyntaxError: invalid syntax (2064058597.py, line 1)

In [70]:
# using iloc
df1.iloc[:,0]   # zero is col index

row1    12.0
row2    45.0
row3     5.0
row4     NaN
row5     1.0
Name: A, dtype: float64

In [71]:
df1.iloc[:,3]   


# syntax to access 4th row
# df1.iloc[row,col]

row1    14.0
row2     3.0
row3     NaN
row4     2.0
row5     6.0
Name: D, dtype: float64

In [ ]:
# select between two rows and two columns

In [83]:
df1.loc[:,"B":]

         B   C     D
row1     7  20  14.0
row2     5  16   3.0
row3    54  11   NaN
row4     3   3   2.0
row5  None   4   6.0

In [86]:
df1.iloc[:,1:]   # row, column

         B   C     D
row1     7  20  14.0
row2     5  16   3.0
row3    54  11   NaN
row4     3   3   2.0
row5  None   4   6.0

In [87]:
df1.iloc[:,1:3]

         B   C
row1     7  20
row2     5  16
row3    54  11
row4     3   3
row5  None   4

In [102]:
# Alternate rows and columns

# a c  or b d

df1.iloc[:,[1,3]]

         B     D
row1     7  14.0
row2     5   3.0
row3    54   NaN
row4     3   2.0
row5  None   6.0

In [104]:


df1.iloc[:,1::2]   # 2 is step

         B     D
row1     7  14.0
row2     5   3.0
row3    54   NaN
row4     3   2.0
row5  None   6.0

In [107]:
# howe work


# create a dataframe containing 5 rows and 15 columns 
# print the column alternatively
# 1. living 1 column in between
# 2. living 2 columns in between

In [10]:
# LIVING 1 COLUMN BETWEEN

import pandas as pd

df2 = pd.DataFrame({"nobita":[97,99,98,96,99],
                   "shizuka":[90,98,94,90,78],
                   "happy":[91,89,56,78,56],
                   "lucky":[90,65,45,78,78],
                   "doraemon":[56,78,54,78,23],
                   "barbi":[78,98,67,90,13],
                   "anamika":[96,78,57,90,56],
                   "pokemon":[78,90,65,45,78],
                   "cindrella":[78,90,91,92,90],
                   "alien":[89,78,90,76,56],
                   "pikachu":[89,56,67,34,78],
                   "raichu":[34,67,89,54,68],
                   "spiderman":[78,65,45,67,78],
                   "dinosaur":[45,67,87,90,89],
                   "ben10":[67,87,56,78,24]}, index=["python","ml","sql","pandas","big_data"])
df2

,nobita,shizuka,happy,lucky,doraemon,barbi,anamika,pokemon,cindrella,alien,pikachu,raichu,spiderman,dinosaur,ben10
python,97,90,91,90,56,78,96,78,78,89,89,34,78,45,67
ml,99,98,89,65,78,98,78,90,90,78,56,67,65,67,87
sql,98,94,56,45,54,67,57,65,91,90,67,89,45,87,56
pandas,96,90,78,78,78,90,90,45,92,76,34,54,67,90,78
big_data,99,78,56,78,23,13,56,78,90,56,78,68,78,89,24

In [11]:
df2.iloc[:,1::2]

          shizuka  lucky  barbi  pokemon  alien  raichu  dinosaur
python         90     90     78       78     89      34        45
ml             98     65     98       90     78      67        67
sql            94     45     67       65     90      89        87
pandas         90     78     90       45     76      54        90
big_data       78     78     13       78     56      68        89

In [12]:
df2.loc[:,"happy"::2]

          happy  doraemon  anamika  cindrella  pikachu  spiderman  ben10
python       91        56       96         78       89         78     67
ml           89        78       78         90       56         65     87
sql          56        54       57         91       67         45     56
pandas       78        78       90         92       34         67     78
big_data     56        23       56         90       78         78     24

In [13]:
# LIVING 2 COLUMN BETWEEN

In [14]:
df2.iloc[:,0::3]

          nobita  lucky  anamika  alien  spiderman
python        97     90       96     89         78
ml            99     65       78     78         65
sql           98     45       57     90         45
pandas        96     78       90     76         67
big_data      99     78       56     56         78

In [15]:
df2.loc[:,"nobita"::3]

          nobita  lucky  anamika  alien  spiderman
python        97     90       96     89         78
ml            99     65       78     78         65
sql           98     45       57     90         45
pandas        96     78       90     76         67
big_data      99     78       56     56         78

In [25]:
selected_rows = df2.loc[df2['nobita']>100]
selected_rows

Empty DataFrame
Columns: [nobita, shizuka, happy, lucky, doraemon, barbi, anamika, pokemon, cindrella, alien, pikachu, raichu, spiderman, dinosaur, ben10]
Index: []

In [42]:
import pandas as pd

# Assuming df2 is your DataFrame
selected_rows = df2[df2.iloc[:, 1] > 97]
selected_rows

,nobita,shizuka,happy,lucky,doraemon,barbi,anamika,pokemon,cindrella,alien,pikachu,raichu,spiderman,dinosaur,ben10
ml,99,98,89,65,78,98,78,90,90,78,56,67,65,67,87

In [6]:
# rough
# use loc to sum in row axis
import pandas as pd

sales_df = pd.DataFrame({"jan": [1000, 2000, 3000], 
                           "feb": [5000, 2000, 1000], 
                           "mar": [7000, 2000, 1000]}, 
                          index=["p1", "p2", "p3"])

In [7]:
p1_sum = sales_df.loc['p1'].sum()
p1_sum

13000